tap "jandedobbeleer/oh-my-posh"
brew "c-blosc"
brew "lzo"
brew "chezmoi"
brew "coreutils"
brew "openssl@3"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "xz"
brew "git"
brew "git-lfs"
brew "glances"
brew "graphviz"
brew "pkgconf"
brew "hdf5"
brew "mariadb"
brew "mkcert"
brew "node"
brew "nss"
brew "pandoc"
brew "tcl-tk"
brew "python-tk@3.13"
brew "rclone"
brew "rustup"
brew "tex-fmt"
brew "tree"
brew "zlib"
brew "zoxide"
brew "jandedobbeleer/oh-my-posh/oh-my-posh", link: false
cask "font-libertinus"
cask "kitty"
cask "tailscale-app"
vscode "anthropic.claude-code"
vscode "charliermarsh.ruff"
vscode "chrisjsewell.myst-tml-syntax"
vscode "codezombiech.gitignore"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "h5web.vscode-h5web"
vscode "james-yu.latex-workshop"
vscode "lextudio.restructuredtext"
vscode "ltex-plus.vscode-ltex-plus"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.wordcount"
vscode "mshr-h.veriloghdl"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "upstash.context7-mcp"
vscode "vstirbu.vscode-mermaid-preview"
vscode "waderyan.gitblame"
uv "esbonio"
uv "pre-commit"
uv "pytest"
uv "ruff"
